{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/hidden3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/hidden3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["input", "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/hidden3/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/sequential/hidden3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/hidden3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/hidden3/Relu", "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/output/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/output/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/hidden3/MatMul/ReadVariableOp", "shape": [3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/hidden3/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "shape": [16, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}]}]}